---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GeoLocation
source: html/d207176d-3329-d185-6940-0dc4da8f6d9d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GeoLocation Property

"Shared Site"

## Syntax (C#)
```csharp
public static ForgeTypeId GeoLocation { get; }
```